yisea123/stm32project/Cood/bsp/Src/bsp.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  *
  * COPYRIGHT(c) 2016 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "can.h"
#include "dma.h"
#include "i2c.h"
#include "spi.h"
#include "tim.h"
#include "usart.h"
#include "gpio.h"
#include "bsp.h"
#include "rtc.h"
#include "adc.h"
#include "main.h"
#include "stm32f4xx_it.h"
#include <stdlib.h>
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void Error_Handler(void);

void* MallocMem(uint16_t size)
{
	if(size)
	{
		//lint -e586 -e526 -e628
		return (void* )malloc(size);
	}

	return NULL;
}
void FreeMem(void* adr)
{
	if(adr)
	{
		//lint -e586 -e526 -e628
		free(adr);
	}

}

void OS_Use(OS_RSEMA x)
{
	if(__get_IPSR() != 0)
		return;
	if(x) xSemaphoreTakeRecursive((QueueHandle_t)x, portMAX_DELAY);
	else {}
}
void OS_Unuse(OS_RSEMA x)
{
	if(__get_IPSR() != 0)
		return;
	if(x) xSemaphoreGiveRecursive((QueueHandle_t)x);
	else {}
}

OS_RSEMA OS_CreateSemaphore(void)
{
	return (OS_RSEMA)xSemaphoreCreateRecursiveMutex();
}

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

void bsp_init(void)
{

  /* Initialize all configured peripherals */

  MX_DMA_Init();
  MX_ADC1_Init();
  MX_ADC3_Init();
  MX_CAN1_Init();
  MX_I2C1_Init();
  MX_SPI3_Init();
  MX_SPI4_Init();
  MX_SPI6_Init();

  MX_I2C2_Init();
  MX_SPI5_Init();
  MX_TIM10_Init();
  MX_TIM12_Init();

  MX_TIM13_Init();
  MX_TIM14_Init();
  MX_TIM9_Init();
  MX_TIM7_Init();
  MX_TIM6_Init();
  MX_TIM5_Init();
  MX_TIM4_Init();
  MX_TIM3_Init();
  MX_TIM2_Init();

  /* USER CODE BEGIN 2 */
  InitMeasPins();
  /* USER CODE END 2 */


}


/** System Clock Configuration
*/
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

  __HAL_RCC_PWR_CLK_ENABLE();

  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 12;
  RCC_OscInitStruct.PLL.PLLN = 360;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 4;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  if (HAL_PWREx_EnableOverDrive() != HAL_OK)
  {
    Error_Handler();
  }

  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;
  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK)
  {
    Error_Handler();
  }

  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, ISR_PRIORITY_TICK, ISR_SUB_PRIORITY_TICK);
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */


/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler */
  /* User can add his own implementation to report the HAL error return state */
	dbg_printf("Error handler");
	abort();
  while(1) 
  {
  }
  /* USER CODE END Error_Handler */ 
}

int32_t TickTimeDiff(const uint32_t oldTick, const uint32_t reqTick)
{
	uint32_t newTick = HAL_GetTick();
	newTick = GetTickDeviation(oldTick, newTick);

	return (int32_t)(newTick - reqTick);
}

uint32_t GetTickDeviation(const uint32_t oldTick, const uint32_t newTick)
{
	uint32_t tickDelay = 0;
	if(oldTick > newTick)
	{
		tickDelay = newTick + (0xFFFFFFFF-oldTick) + 1;
	}
	else
	{
		tickDelay = newTick - oldTick;
	}
	return tickDelay;
}

static const uint32_t countUs = 25; // / 16;	// divider of 16 is measured by osc

void delay_us(const uint32_t count)
{
	// todo  need minus sp operations
	uint32_t countUs1 = countUs;
	uint32_t count1 = count;
	for (; count1 > 0; count1--)
	{
		for(countUs1 = countUs;countUs1>0;countUs1--);
	}
}


osStatus MessagePush (uint32_t line,char* file, osMessageQId queue_id, uint32_t info, uint32_t millisec)
{
	if(queue_id == NULL)
		return osErrorResource;
//	assert_param(queue_id);
	osStatus ret = osMessagePut(queue_id,info, millisec);

	if(ret == osOK)
	{
	//	if(queue_id == SCH_IO_ID)
	//		TracePrint(0xFFFF, "Queue push : %d, line: %d\n",queue_id, line);
		//it is ok
	}
	else
	{
		TraceDBG(TSK_ID_MCU_STATUS, "Queue push Error: %d,%x,file:%s line: %d\n",queue_id,queue_id,file, line);
		//xQueueReset( queue_id);
		osMessagePut(queue_id,info, millisec);
	}

	return ret;


}
#if 0
osStatus MessagePurge (uint32_t line,char* file, osMessageQId queue_id, uint32_t info, uint32_t millisec)
{
	if(queue_id == NULL)
		return osErrorResource;
	osEvent event;
	event = osMessageGet(queue_id, 0);
	while(event.status == osEventMessage)
	{
		event = osMessageGet(queue_id, 0);
	}
//	assert_param(queue_id);
	return osMessagePut(queue_id,info, millisec);
}

#endif

osStatus SignalPush(osThreadId thread_id, int32_t signal)
{
	if(thread_id == NULL)
		return osErrorResource;

	return (osStatus)osSignalSet(thread_id,signal);
}
#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
//	while(1);
	TraceDBG(TSK_ID_MCU_STATUS, "Assert Failed: %s, line: %d",file, line);
}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
